backend/app/graphql/mutations/create_workout_mutation.rb

INSERT INTO "workouts" ("date", "notes", "feeling", "pain", "rpe", "ended_at", "duration_ms", "created_at", "updated_at") VALUES ('2025-09-07', NULL, NULL, NULL, NULL, NULL, NULL, '2025-09-08 16:54:41.841982', '2025-09-08 16:54:41.841982') RETURNING "id"
---
    def resolve(date:)
      workout = Workout.new(date: date)

      if workout.save